Revit 2026 API

# ModelCurveArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ModelCurveArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
ModelCurveArrayIterator()
```
```fsharp
new : unit -> ModelCurveArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

ModelCurveArrayIterator Class

Autodesk.Revit.DB Namespace